{"type":"data","nodes":[null,{"type":"data","data":[{"slug":1,"post":2},"useful-tips-that-will-make-your-life-easier-as-a-developer","\u003Ch1 id=\"useful-tips-that-will-make-your-life-easier-as-a-developer\"\u003EUseful tips that will make your life easier as a developer\u003C\u002Fh1\u003E\n\u003Ch4 id=\"3-apr-2023\"\u003E3 Apr, 2023\u003C\u002Fh4\u003E\n\u003Cp\u003E&nbsp;\u003C\u002Fp\u003E\n\u003Cp\u003EHere some tips that I use literally everyday as a Software Engineer:\u003C\u002Fp\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ch5 id=\"take-advantage-of-chatgpt-whenever-you-can\"\u003ETake advantage of ChatGPT whenever you can\u003C\u002Fh5\u003E\n\u003Cp\u003E  There&#39;s no need to talk about this, right? Everyone, especially developers, already know that ChatGPT can answer almost any questions that pop up in your mind. But make sure to double-check because sometimes it can give you incorrect information.\u003C\u002Fp\u003E\n\u003C\u002Fli\u003E\n\u003Cli\u003E\u003Ch5 id=\"something-to-something-online-converter\"\u003E&quot;Something to something&quot; online converter\u003C\u002Fh5\u003E\n\u003Cp\u003E  Are you struggling to understand every format that comes across your everyday work to do simple conversions (e.g. XML to JSON, Cron Expression, etc)? I was there too, and the solution is simple, just typing the magic words \u003Cem\u003E&quot;[something] to [something] online converter&quot;\u003C\u002Fem\u003E. It&#39;s very likely that there&#39;s a tool out there that fits perfectly with your needs and can save you a vast amount of time.\u003C\u002Fp\u003E\n\u003C\u002Fli\u003E\n\u003Cli\u003E\u003Ch5 id=\"make-sure-to-understand-things-what-you-do-to-the-very-core\"\u003EMake sure to understand things what you do to the very core\u003C\u002Fh5\u003E\n\u003Cp\u003E  Don&#39;t underestimate the importance of fundamental knowledge. Don&#39;t just ask &quot;what&#39;s the solution for this problem?&quot; You also want to know &quot;why&quot; and &quot;how&quot;. What does it bring to the table? How does it actually work? If you can explain complex knowledge to a 5-year-old kid, then you know you have a deep\u002Fcomprehensive understanding of it.\u003C\u002Fp\u003E\n\u003C\u002Fli\u003E\n\u003Cli\u003E\u003Ch5 id=\"dont-live-with-a-broken-window\"\u003EDon&#39;t live with a broken window\u003C\u002Fh5\u003E\n\u003Cp\u003E  If something has been done improperly - whether it be bad code or some hack\u002Fcheat in the codebase - take action on it ASAP. Don&#39;t leave it there and comfort yourself with the \u003Cem\u003E&quot;don&#39;t touch it if it works&quot;\u003C\u002Fem\u003E mindset. By doing so, problems will not pile up, and your life will be easier. (from \u003Ca href=\"https:\u002F\u002Fwww.amazon.com\u002FPragmatic-Programmer-Journeyman-Master\u002Fdp\u002F020161622X\"\u003EThe Pragmatic Programmer\u003C\u002Fa\u003E.)\u003C\u002Fp\u003E\n\u003C\u002Fli\u003E\n\u003C\u002Ful\u003E\n"],"uses":{"dependencies":["http://sveltekit-prerender/useful-tips-that-will-make-your-life-easier-as-a-developer.md"],"params":["slug"]}}]}
